---
type: ExternallyTaggedGeometryObject
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ExternallyTaggedGeometryObject

`Autodesk.Revit.DB.ExternallyTaggedGeometryObject` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ExternalId | 2022 | `public ExternalGeometryId ExternalId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |